PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
			} else if (dshot_inst[channel].bdshot && dshot_inst[channel].state == DSHOT_12BIT_TRANSFERRED) {
				disable_shifter_status_interrupts(FLEXIO2_BASE, 1 << channel);
				dshot_inst[channel].state = BDSHOT_RECEIVE;

				/* Transmit done, disable timer and reconfigure to receive*/
				flexio_putreg32(FLEXIO2_BASE, 0x0, IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);

				/* Input data from pin, no start/stop bit*/
				flexio_putreg32(FLEXIO2_BASE, FLEXIO_SHIFTCFG_INSRC(FLEXIO_SHIFTER_INPUT_FROM_PIN) |
						FLEXIO_SHIFTCFG_PWIDTH(0) |
						FLEXIO_SHIFTCFG_SSTOP(FLEXIO_SHIFTER_STOP_BIT_DISABLE) |
						FLEXIO_SHIFTCFG_SSTART(FLEXIO_SHIFTER_START_BIT_DISABLED_LOAD_DATA_ON_SHIFT),
						IMXRT_FLEXIO_SHIFTCFG0_OFFSET + channel * 0x4);

				/* Shifter receive mdoe, on FXIO pin input */
				flexio_putreg32(FLEXIO2_BASE, FLEXIO_SHIFTCTL_TIMSEL(channel) |
						FLEXIO_SHIFTCTL_TIMPOL(FLEXIO_SHIFTER_TIMER_POLARITY_ON_POSITIVE) |
						FLEXIO_SHIFTCTL_PINCFG(FLEXIO_PIN_CONFIG_OUTPUT_DISABLED) |
						FLEXIO_SHIFTCTL_PINSEL(timer_io_channels[channel].dshot.flexio_pin) |
						FLEXIO_SHIFTCTL_PINPOL(FLEXIO_PIN_ACTIVE_LOW) |
						FLEXIO_SHIFTCTL_SMOD(FLEXIO_SHIFTER_MODE_RECEIVE),
						IMXRT_FLEXIO_SHIFTCTL0_OFFSET + channel * 0x4);

				/* Make sure there no shifter flags high from transmission */
				clear_shifter_status_flags(FLEXIO2_BASE, 1 << channel);

				/* Enable on pin transition, resychronize through reset on rising edge */
				flexio_putreg32(FLEXIO2_BASE, FLEXIO_TIMCFG_TIMOUT(FLEXIO_TIMER_OUTPUT_ONE_AFFECTED_BY_RESET) |
						FLEXIO_TIMCFG_TIMDEC(FLEXIO_TIMER_DEC_SRC_ON_FLEX_IO_CLOCK_SHIFT_TIMER_OUTPUT) |
						FLEXIO_TIMCFG_TIMRST(FLEXIO_TIMER_RESET_ON_TIMER_PIN_RISING_EDGE) |
						FLEXIO_TIMCFG_TIMDIS(FLEXIO_TIMER_DISABLE_ON_TIMER_COMPARE) |
						FLEXIO_TIMCFG_TIMENA(FLEXIO_TIMER_ENABLE_ON_TRIGGER_BOTH_EDGE) |
						FLEXIO_TIMCFG_TSTOP(FLEXIO_TIMER_STOP_BIT_ENABLE_ON_TIMER_DISABLE) |
						FLEXIO_TIMCFG_TSTART(FLEXIO_TIMER_START_BIT_ENABLED),
						IMXRT_FLEXIO_TIMCFG0_OFFSET + channel * 0x4);

				/* Enable on pin transition, resychronize through reset on rising edge */
				flexio_putreg32(FLEXIO2_BASE, bdshot_tcmp, IMXRT_FLEXIO_TIMCMP0_OFFSET + channel * 0x4);

				/* Trigger on FXIO pin transition, Baud mode */
				flexio_putreg32(FLEXIO2_BASE, FLEXIO_TIMCTL_TRGSEL(2 * timer_io_channels[channel].dshot.flexio_pin) |
						FLEXIO_TIMCTL_TRGPOL(FLEXIO_TIMER_TRIGGER_POLARITY_ACTIVE_HIGH) |
						FLEXIO_TIMCTL_TRGSRC(FLEXIO_TIMER_TRIGGER_SOURCE_INTERNAL) |
						FLEXIO_TIMCTL_PINCFG(FLEXIO_PIN_CONFIG_OUTPUT_DISABLED) |
						FLEXIO_TIMCTL_PINSEL(0) |
						FLEXIO_TIMCTL_PINPOL(FLEXIO_PIN_ACTIVE_LOW) |
						FLEXIO_TIMCTL_TIMOD(FLEXIO_TIMER_MODE_DUAL8_BIT_BAUD_BIT),
						IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);

				/* Enable shifter interrupt for receiving data */
				enable_shifter_status_interrupts(FLEXIO2_BASE, 1 << channel);
			}
		}

	}

	return OK;
}

int up_dshot_init(uint32_t channel_mask, unsigned dshot_pwm_freq, bool enable_bidirectional_dshot)
{
	/* Calculate dshot timings based on dshot_pwm_freq */
	dshot_tcmp = 0x2F00 | (((BOARD_FLEXIO_PREQ / (dshot_pwm_freq * 3) / 2) - 1) & 0xFF);
	bdshot_tcmp = 0x2900 | (((BOARD_FLEXIO_PREQ / (dshot_pwm_freq * 5 / 4) / 2) - 3) & 0xFF);

	bool flexio1_channels = false;
	bool flexio2_channels = false;

	for (unsigned i = 0; (channel_mask != 0) && (i < DSHOT_TIMERS); i++) {
		if (channel_mask & (1 << i)) {
			if (timer_io_channels[i].flex_io_base == FLEXIO1_BASE) {
				PX4_INFO("Flexio1 channel found");
				flexio1_channels = true;

			} else if (timer_io_channels[i].flex_io_base == FLEXIO2_BASE) {
				PX4_INFO("Flexio2 channel found");
				flexio2_channels = true;

			} else {PX4_ERR("Invalid flexio base defined");}
		}
	}

	if (flexio1_channels) { // FlexIO peripheral 1
		/* Clock FlexIO peripheral */
		imxrt_clockall_flexio1();
		/* Reset FlexIO 1 peripheral */
		flexio_modifyreg32(FLEXIO1_BASE, IMXRT_FLEXIO_CTRL_OFFSET, 0,
				   FLEXIO_CTRL_SWRST_MASK);
		flexio_putreg32(FLEXIO1_BASE, 0, IMXRT_FLEXIO_CTRL_OFFSET);

		/* Initialize FlexIO 1 peripheral */
		flexio_modifyreg32(FLEXIO1_BASE, IMXRT_FLEXIO_CTRL_OFFSET,
				   (FLEXIO_CTRL_DOZEN_MASK |
				    FLEXIO_CTRL_DBGE_MASK |
				    FLEXIO_CTRL_FASTACC_MASK |
				    FLEXIO_CTRL_FLEXEN_MASK),
				   (FLEXIO_CTRL_DBGE(1) |
				    FLEXIO_CTRL_FASTACC(1) |
				    FLEXIO_CTRL_FLEXEN(0)));
		/* FlexIO IRQ handling */
		up_enable_irq(IMXRT_IRQ_FLEXIO1);
		irq_attach(IMXRT_IRQ_FLEXIO1, flexio1_irq_handler, 0);

	}

	if (flexio2_channels) { // FlexIO peripheral 2
		/* Clock FlexIO peripheral */
		imxrt_clockall_flexio2();
		/* Reset FlexIO 2 peripheral */
		flexio_modifyreg32(FLEXIO2_BASE, IMXRT_FLEXIO_CTRL_OFFSET, 0,
				   FLEXIO_CTRL_SWRST_MASK);
		flexio_putreg32(FLEXIO2_BASE, 0, IMXRT_FLEXIO_CTRL_OFFSET);

		/* Initialize FlexIO 2 peripheral */
		flexio_modifyreg32(FLEXIO2_BASE, IMXRT_FLEXIO_CTRL_OFFSET,
				   (FLEXIO_CTRL_DOZEN_MASK |
				    FLEXIO_CTRL_DBGE_MASK |
				    FLEXIO_CTRL_FASTACC_MASK |
				    FLEXIO_CTRL_FLEXEN_MASK),
				   (FLEXIO_CTRL_DBGE(1) |
				    FLEXIO_CTRL_FASTACC(1) |
				    FLEXIO_CTRL_FLEXEN(0)));

		up_enable_irq(IMXRT_IRQ_FLEXIO2);
		irq_attach(IMXRT_IRQ_FLEXIO2, flexio2_irq_handler, 0);

	}

	dshot_mask = 0x0;

	for (unsigned channel = 0; (channel_mask != 0) && (channel < DSHOT_TIMERS); channel++) {
		if (channel_mask & (1 << channel)) {

			if (timer_io_channels[channel].dshot.pinmux == 0) { // board does not configure dshot on this pin
				continue;
			}

			imxrt_config_gpio(timer_io_channels[channel].dshot.pinmux | IOMUX_PULL_UP);

			dshot_inst[channel].bdshot = enable_bidirectional_dshot;

			if (timer_io_channels[channel].flex_io_base == FLEXIO1_BASE) {

				flexio_dshot_output(FLEXIO1_BASE, channel, timer_io_channels[channel].dshot.flexio_pin, dshot_tcmp,
						    dshot_inst[channel].bdshot);

			} else if (timer_io_channels[channel].flex_io_base == FLEXIO2_BASE) {
				flexio_dshot_output(FLEXIO2_BASE, channel, timer_io_channels[channel].dshot.flexio_pin, dshot_tcmp,
						    dshot_inst[channel].bdshot);

			} else {PX4_ERR("Invalid or undefined flexio bases in timer config");}

			dshot_inst[channel].init = true;

