PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
			// Mask channel to be active on dshot
			dshot_mask |= (1 << channel);
		}
	}

	if (flexio1_channels) {
		flexio_modifyreg32(FLEXIO1_BASE, IMXRT_FLEXIO_CTRL_OFFSET, 0,
				   FLEXIO_CTRL_FLEXEN_MASK);
	}

	if (flexio2_channels) {
		flexio_modifyreg32(FLEXIO2_BASE, IMXRT_FLEXIO_CTRL_OFFSET, 0,
				   FLEXIO_CTRL_FLEXEN_MASK);

	}

	return channel_mask;
}

void up_bdshot_erpm(void)
{
	uint32_t value;
	uint32_t data;
	uint32_t csum_data;
	uint8_t exponent;
	uint16_t period;
	uint16_t erpm;

	bdshot_parsed_recv_mask = 0;

	// Decode each individual channel
	for (uint8_t channel = 0; (channel < DSHOT_TIMERS); channel++) {
		if (bdshot_recv_mask & (1 << channel)) {
			value = ~dshot_inst[channel].raw_response & 0xFFFFF;

			/* if lowest significant isn't 1 we've got a framing error */
			if (value & 0x1) {
				/* Decode RLL */
				value = (value ^ (value >> 1));

				/* Decode GCR */
				data = gcr_decode[value & 0x1fU];
				data |= gcr_decode[(value >> 5U) & 0x1fU] << 4U;
				data |= gcr_decode[(value >> 10U) & 0x1fU] << 8U;
				data |= gcr_decode[(value >> 15U) & 0x1fU] << 12U;

				/* Calculate checksum */
				csum_data = data;
				csum_data = csum_data ^ (csum_data >> 8U);
				csum_data = csum_data ^ (csum_data >> NIBBLES_SIZE);

				if ((csum_data & 0xFU) != 0xFU) {
					dshot_inst[channel].crc_error_cnt++;

				} else {
					data = (data >> 4) & 0xFFF;

					if (data == 0xFFF) {
						erpm = 0;

					} else {
						exponent = ((data >> 9U) & 0x7U); /* 3 bit: exponent */
						period = (data & 0x1ffU); /* 9 bit: period base */
						period = period << exponent; /* Period in usec */
						erpm = ((1000000U * 60U / 100U + period / 2U) / period);
					}

					dshot_inst[channel].erpm = erpm;
					bdshot_parsed_recv_mask |= (1 << channel);
					dshot_inst[channel].last_no_response_cnt = dshot_inst[channel].no_response_cnt;
				}

			} else {
				dshot_inst[channel].frame_error_cnt++;
			}
		}
	}
}

int up_bdshot_num_erpm_ready(void)
{
	int num_ready = 0;

	for (unsigned i = 0; i < DSHOT_TIMERS; ++i) {
		// We only check that data has been received, rather than if it's valid.
		// This ensures data is published even if one channel has bit errors.
		if (bdshot_recv_mask & (1 << i)) {
			++num_ready;
		}
	}

	return num_ready;
}


int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	if (bdshot_parsed_recv_mask & (1 << channel)) {
		*erpm = (int)dshot_inst[channel].erpm;
		return 0;
	}

	return -1;
}

int up_bdshot_channel_status(uint8_t channel)
{
	if (channel < DSHOT_TIMERS) {
		return ((dshot_inst[channel].no_response_cnt - dshot_inst[channel].last_no_response_cnt) < BDSHOT_OFFLINE_COUNT);
	}

	return -1;
}

void up_bdshot_status(void)
{

	for (uint8_t channel = 0; (channel < DSHOT_TIMERS); channel++) {

		if (dshot_inst[channel].init) {
			PX4_INFO("Channel %i %s Last erpm %i value", channel, up_bdshot_channel_status(channel) ? "online" : "offline",
				 dshot_inst[channel].erpm);
			PX4_INFO("CRC errors Frame error No response");
			PX4_INFO("%10lu %11lu %11lu", dshot_inst[channel].crc_error_cnt, dshot_inst[channel].frame_error_cnt,
				 dshot_inst[channel].no_response_cnt);
		}
	}
}

void up_dshot_trigger(void)
{
	bool flexio1_channels = false;
	bool flexio2_channels = false;


	for (unsigned i = 0; (i < DSHOT_TIMERS); i++) {
		if (dshot_inst[i].init && dshot_inst[i].data_seg1 != 0) {

			if (timer_io_channels[i].flex_io_base == FLEXIO1_BASE) {
				flexio1_channels = true;
				PX4_INFO("Dshot trigger channels: Flexio1");

			} else if (timer_io_channels[i].flex_io_base == FLEXIO2_BASE) {
				flexio2_channels = true;
				PX4_INFO("Dshot trigger channels: Flexio2");

			} else {PX4_ERR("Invalid flexio base defined");}
		}
	}

	// Calc data now since we're not event driven
	if (bdshot_recv_mask != 0x0) {
		up_bdshot_erpm();
	}

	if (flexio1_channels) {
		clear_timer_status_flags(FLEXIO1_BASE, 0xFF);
	}

	if (flexio2_channels) {
		clear_timer_status_flags(FLEXIO2_BASE, 0xFF);
	}


	for (uint8_t channel = 0; (channel < DSHOT_TIMERS); channel++) {
		if (dshot_inst[channel].bdshot && (bdshot_recv_mask & (1 << channel)) == 0) {
			dshot_inst[channel].no_response_cnt++;
		}

		if (dshot_inst[channel].init && dshot_inst[channel].data_seg1 != 0) {
			if (timer_io_channels[channel].flex_io_base == FLEXIO1_BASE) {
				flexio_putreg32(FLEXIO1_BASE, dshot_inst[channel].data_seg1, IMXRT_FLEXIO_SHIFTBUF0_OFFSET + channel * 0x4);

			} else if (timer_io_channels[channel].flex_io_base == FLEXIO2_BASE) {
				flexio_putreg32(FLEXIO2_BASE, dshot_inst[channel].data_seg1, IMXRT_FLEXIO_SHIFTBUF0_OFFSET + channel * 0x4);
			}

		}
	}

	bdshot_recv_mask = 0x0;

	if (flexio1_channels) {
		clear_timer_status_flags(FLEXIO1_BASE, 0xFF);
		enable_shifter_status_interrupts(FLEXIO1_BASE, 0xFF);
		enable_timer_status_interrupts(FLEXIO1_BASE, 0xFF);
	}

	if (flexio2_channels) {
		clear_timer_status_flags(FLEXIO2_BASE, 0xFF);
		enable_shifter_status_interrupts(FLEXIO2_BASE, 0xFF);
		enable_timer_status_interrupts(FLEXIO2_BASE, 0xFF);
	}


}

/* Expand packet from 16 bits 48 to get T0H and T1H timing */
uint64_t dshot_expand_data(uint16_t packet)
{
	unsigned int mask;
	unsigned int index = 0;
	uint64_t expanded = 0x0;

	for (mask = 0x8000; mask != 0; mask >>= 1) {
		if (packet & mask) {
			expanded = expanded | ((uint64_t)0x3 << index);

		} else {
			expanded = expanded | ((uint64_t)0x1 << index);
		}

		index = index + 3;
	}

	return expanded;
}

/**
* bits 	1-11	- throttle value (0-47 are reserved, 48-2047 give 2000 steps of throttle resolution)
* bit 	12		- dshot telemetry enable/disable
* bits 	13-16	- XOR checksum
**/
void dshot_motor_data_set(unsigned channel, uint16_t throttle, bool telemetry)
{

	if (channel < DSHOT_TIMERS && dshot_inst[channel].init) {
		uint16_t csum_data;
		uint16_t packet = 0;
		uint16_t checksum = 0;

		packet |= throttle << DSHOT_THROTTLE_POSITION;
		packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

		if (dshot_inst[channel].bdshot) {
			csum_data = ~packet;

		} else {
			csum_data = packet;
		}

		/* XOR checksum calculation */
		csum_data >>= NIBBLES_SIZE;

		for (unsigned i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
			checksum ^= (csum_data & 0x0F); // XOR data by nibbles
			csum_data >>= NIBBLES_SIZE;
		}

		packet |= (checksum & 0x0F);

		uint64_t dshot_expanded = dshot_expand_data(packet);

		dshot_inst[channel].data_seg1 = (uint32_t)(dshot_expanded & 0xFFFFFF);
		dshot_inst[channel].irq_data = (uint32_t)(dshot_expanded >> 24);
		dshot_inst[channel].state = DSHOT_START;

		if (dshot_inst[channel].bdshot) {

			if (timer_io_channels[channel].flex_io_base == FLEXIO1_BASE) {
				flexio_putreg32(FLEXIO1_BASE, 0x0, IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);
				disable_shifter_status_interrupts(FLEXIO1_BASE, 1 << channel);

				flexio_dshot_output(FLEXIO1_BASE, channel, timer_io_channels[channel].dshot.flexio_pin, dshot_tcmp,
						    dshot_inst[channel].bdshot);

				clear_timer_status_flags(FLEXIO1_BASE, 0xFF);

			} else if (timer_io_channels[channel].flex_io_base == FLEXIO2_BASE) {
				flexio_putreg32(FLEXIO2_BASE, 0x0, IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);
				disable_shifter_status_interrupts(FLEXIO2_BASE, 1 << channel);

				flexio_dshot_output(FLEXIO2_BASE, channel, timer_io_channels[channel].dshot.flexio_pin, dshot_tcmp,
						    dshot_inst[channel].bdshot);

				clear_timer_status_flags(FLEXIO2_BASE, 0xFF);

			}

		}
	}
}

int up_dshot_arm(bool armed)
{
	return io_timer_set_enable(armed, IOTimerChanMode_Dshot, IO_TIMER_ALL_MODES_CHANNELS);
}
